#include "font.h"

GLubyte nl_font_i[128][48] = {
    {
        // 0

    }, {
        // 1

    }, {
        // 2

    }, {

    }, {

    }, {

    }, {

    }, {

    }, {

    }, {

    }, {

    }, {

    }, {

    }, {

    }, {

    }, {

    }, {

    }, {

    }, {

    },
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {}, {

    }, {

    }, {
        // 70
        0xe0, 0x00,
        0xe0, 0x00,
        0xe0, 0x00,
        0xe0, 0x00,
        0xe0, 0x00,
        0xe0, 0x00,
        0xe0, 0x00,
        0xe0, 0x00,
        0xe0, 0x00,
        0xe0, 0x00,
        0xff, 0xff,
        0xff, 0xff,
        0xff, 0xff,
        0xe0, 0x00,
        0xe0, 0x00,
        0xe0, 0x00,
        0xe0, 0x00,
        0xe0, 0x00,
        0xe0, 0x00,
        0xe0, 0x00,
        0xe0, 0x00,
        0xff, 0xff,
        0xff, 0xff,
        0xff, 0xff
    }, {

    }, {

    }, {

    }, {

    }, {

    }, {

    }, {

    }, {

    }, {

    },
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {},
    {}, {

    }, {

    },
    {},
    {},
    {},
    {},
    {},
    {}
};


void nl_font::draw(int _w, int _h, int m_w, int m_h)
{
	glClear(GL_COLOR_BUFFER_BIT);
    glPixelStorei (GL_UNPACK_ALIGNMENT, 1);
	glColor3f(0, 0, 0);
	glLoadIdentity();
    _w -= m_w / 2;
    _h -= m_h / 2;
    float w = _w / (m_w / 2);
    float h = _h / (m_h / 2);
	glRasterPos2i(w, h); //指定当前光栅位置
	glBitmap(16, 24, 0, 0, 18, 0, nl_font_i[70]);
	glBitmap(16, 24, 0, 0, 18, 0, nl_font_i[70]);
}
